In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
vehicles={"Type":["Car","SUV","Truck","Scooter","Bike"], "Cost":["500","600","800","300","200"]}

In [3]:
type(vehicles)

dict

In [4]:
df=pd.DataFrame(vehicles,columns=["Type","Cost"])

In [5]:
df

      Type Cost
0      Car  500
1      SUV  600
2    Truck  800
3  Scooter  300
4     Bike  200

In [6]:
df_flip=df.T

In [7]:
df_flip

        0    1      2        3     4
Type  Car  SUV  Truck  Scooter  Bike
Cost  500  600    800      300   200

In [8]:
df_flip=df_flip.rename(columns={
    df_flip.columns[0]:"Option 1"
})

In [9]:
df_flip

     Option 1    1      2        3     4
Type      Car  SUV  Truck  Scooter  Bike
Cost      500  600    800      300   200

In [10]:
df_flip=df_flip.rename(columns={
    df_flip.columns[1]:"Option 2",
    df_flip.columns[2]:"Option 3",
    df_flip.columns[3]:"Option 4",
    df_flip.columns[4]:"Option 5",
})

In [11]:
df_flip

     Option 1 Option 2 Option 3 Option 4 Option 5
Type      Car      SUV    Truck  Scooter     Bike
Cost      500      600      800      300      200

In [12]:
df_next=df_flip.T

In [13]:
df_next

             Type Cost
Option 1      Car  500
Option 2      SUV  600
Option 3    Truck  800
Option 4  Scooter  300
Option 5     Bike  200

In [16]:
type(df_next)

pandas.core.frame.DataFrame

In [17]:
df_next["Cost"]=df_next["Cost"].astype(float)

In [18]:
df_next

             Type   Cost
Option 1      Car  500.0
Option 2      SUV  600.0
Option 3    Truck  800.0
Option 4  Scooter  300.0
Option 5     Bike  200.0

In [19]:
df_next["Sales Price"]=df_next["Cost"]*0.75

In [20]:
df_next

             Type   Cost  Sales Price
Option 1      Car  500.0        375.0
Option 2      SUV  600.0        450.0
Option 3    Truck  800.0        600.0
Option 4  Scooter  300.0        225.0
Option 5     Bike  200.0        150.0